Revit 2026 API

# EvaluatedParameter Methods

---

The EvaluatedParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString(Document) | Get the parameter value as a string with units. |
|  | AsValueString(Document, FormatOptions) | Get the parameter value as a string with units. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

EvaluatedParameter Class

Autodesk.Revit.DB Namespace